{
  "asin": "0321321367", 
  "price": 59.07, 
  "reviewText": "We used this book in a class which was my first academic introduction to data mining.The book's strengths are that it does a good job covering the field as it was around the 2008-2009 timeframe. Included are discussions of exploring data, classification, clustering, association analysis, cluster analysis, and anomaly detection. Additional bonus appendices cover some elements of linear algebra, dimensionality reduction, probability and statistics, regression analysis, and optimization, in case those concepts are fuzzy for the student. They're by no means thorough enough to learn the topic, merely to remind the reader of salient points they should remember.I liked the structure of the book, with each analysis topic being divided into a basic concepts and algorithms chapter, followed by an additional issues and algorithms chapter.I liked that when algorithms were presented, they were presented as pseudocode rather than in any particular language.What I did not like is that separating the concepts from their applications created a bit too much distance for those wanting to apply these concepts. In our class, we were using a tool called Weka, which provides reference implementations of various data mining algorithms in Java, and sometimes it was difficult to tell what we should learn from the results of our experiments. The book did not discuss this very deeply, and certainly not against the types of results that we were getting from our application.During the course, because I knew we would be relying on Weka, I purchased a copy of ISBN-10: 0123748569 http://www.amazon.com/Data-Mining-Practical-Techniques-Management/dp/0123748569/ref=pd_bxgy_b_text_b, which was written by the group that maintains Weka. I found their book to be helpful while I ran the Weka tool, and I was able to use it to develop command line use of the tool and solve some memory management problems. This book also covers much the same ground, although from a bit more practical perspective.Later, because I'm interested in data mining in a large database environment, I purchased ISBN-10: 0123814790 http://www.amazon.com/Data-Mining-Concepts-Techniques-Management/dp/0123814790/ref=pd_bxgy_b_text_c, which is much more focused on the \"how\" of data mining, to include describing the use of data cubes and the necessities of processing it using data mining algorithms.I cannot complain about Tan's book, just that I wished it had slightly more thorough explanations of what one should learn as data mining is certainly an iterative process. If you're interested in Weka, I recommend the Witten book, and if you're new to data modeling as well, I recommend the Han book.", 
  "title": "Introduction to Data Mining"
}