{
  "asin": "0387310738", 
  "price": 25.6, 
  "reviewText": "This book is a fairly thorough overview of typical topics employed in a graduate machine learning course. However, from page 5 on, expect to see more equations on each page than paragraphs of text (with most of the remaining text explaining the context of the variables within the equations). Now, for someone such as myself who enjoys mathematics, this is not a problem. However, I would not recommend this book for someone with a mathematics background that is in any way weak. Furthermore, there is a more fundamental problem with the presentation of the material that warrants this book no more than a 3-star rating: the simple intuitiveness of the concepts is completely lost within the mathematics. Instead of explaining what variables represent and leaving it to the reader to figure  out what is going on, this book could be made much more approachable by simply stating the intuition behind the equations. Take the sum rule, one of the first theorems in the book, for an example of how the author muddles what is effectively a basic and intuitive concept: the book has a fairly lengthy definition of several variables representing concepts such as \"the number of observations in which x_ij appears\" prior to presenting a summation over all y-variables (a notational convention that the author admits is \"cumbersome\" on the next page, and states that \"there will be no need for such pedantry\" as that which he proceeds to perpetrate throughout the book!), while he could have simply presented the simplified sum on the following page (p(X) = sum(p(X,Y), Y)) and it would be immediately clear to most readers what he was attempting to explain. He could also simply state the intuition behind the theorem in English, that summing over every event yields a probability of one, and therefore summing over all events in which a variable appears effectively marginalizes the variable (something he comes close to doing after the presentation of the equation, but by then, the reader's time has already been wasted). Similar examples abound throughout the book, becoming particularly bad during the middle sections, when the techniques begin to become less intuitive.As another reader mentioned, the author also commits the serious mistake of using pi for a symbol other than the constant or the product operator, which muddles the equations on a skim and forces the reader to refer back to the variable definitions to determine the context.Having done work in machine learning's applied cousin, data mining, and thus having used many of the techniques presented in the book in actual research, I can't help but think that the presentation of the book's content could be much clearer. When doing work in the field, we can look up the equations as-needed; it is the knowledge of *when* and *how* to apply or extend these techniques that is more important, and that is the area in which I feel this book is lacking.", 
  "title": "Pattern Recognition and Machine Learning (Information Science and Statistics)"
}