{
  "asin": "0387952845", 
  "price": 18.6, 
  "reviewText": "The book is written by some of the biggest names currently in the field, and thus is written at a certain level, this isn't a fault of the book or the authers, but rather it was written for a specific audience.  However I did find it odd when they would occassionally explain basic readily known notation, but later on assume the reader is familiar with what I would regard as advanced notation, or leave out quite a few steps in their mathematics assuming the reader understands what they did.  This book covers a wide range of techniques ranging from the more traditional to the current, and for each topic presents an overview of the technique and provides adequate references for further exploration.The reader should have a good underlying understanding of linear algebra, statistics and probability theory and also be familiar with the techniques presented here.  This book was used in a graduate engineering data mining class, and most of us struggled greatly with the book.  This book probably would have been more appropriate if this was a book to augment another text, or if this had not been the first time we had seen topics such as those presented, this being the book to explain neural networks, support vector machines and whatnot when you've never seen them before makes for a very bewildering experience, but once you find a few journal articles the techniques actually are fairly easy to understand.The book does not explain how to implement using software any of the techniques, this is a topic left up to other books, such as Modern Applied Statistics with S by Ripley and Venerables, and only in their discussion about apriori for association rules did I see that they state a software package.  It would have been nice if they would have given some insight into how they created some of the great graphics that punctuate the book, perhaps as additional material on the website.A book that is more down to earth for engineers, albeit different in scope, would be Duda and Hart's Pattern Classification, which I believe are electrical engineers and written more from an engineering standpoint.  In addition the Duda and Hard book gives a lot of applications-based problems and has an associated MATLAB handbook to walk readers through building many types of learners, while this book the end-of-chapter excercises are almost exclusively proofs and theoretical excercises.  Not a fault of the book, but rather just a difference and depends on what the reader wants to get out of it.Ultimately, even though it did prove to be a rather confusing book, I have learned a lot from it and will continue to go through it to learn even more from it as it does tend to become more lucid the more I go through it.", 
  "title": "The Elements of Statistical Learning: Data Mining, Inference, and Prediction (Springer Series in Statistics)"
}