{
  "asin": "0470526823", 
  "price": 28.26, 
  "reviewText": "I am a data mining trainer and consultant. This book not only has good content, but it offers a 90 day license of software with which to rehearse the case study examples. My comments on the book will be accompanied by comments on the software. The book is the perfect fit for its intended audience. With the caution that certain readers will do better elsewhere, I think it is a great book. The major topics are addressed, albeit briefly, with clarity. If you are a first timer reader of this subject, there are not many books that will do a better job explaining these technical subjects for a general audience.Like most full time data miners, I would have difficulty living within the constraints of Excel. XLMiner is a fine piece of software, but it lives inside Excel as an Excel add-on. The most famous limitation is having no more than 1,000,000 rows of data, but that nature of that limitation applied to Data Mining is frequently misunderstood. I am often on projects with \"big data\" clients where I only model 100,000 or fewer records. XLMiner allows you to read from a database larger than Excel can handle, and let's you write out to a database larger than Excel can handle. I was surprised and impressed by this. In the end, though, it still isn't enough. I need to be able to merge and manipulate my large data files so that I can carefully select the smaller fraction that I am going to model. In short, I can't live without my more powerful tools. There is an essay offered as a sidebar in the book on the state of the Data Mining Software Tools market by Herb Edelstein which discusses exactly this fact. XLMiner was originally developed as a piece of teaching software, and it excels at that. It doesn't intend to be a deployment tool for the whole business enterprise like some of the more powerful Data Mining suites. If you don't have access to such tools you might be pleasantly surprised what it can do since the other tools are many times more expensive.Despite this limitation, this is a strong book. It would be just perfect for MBAs that are intrigued with Data Mining. It would be great for a first course in Data Mining provided that it wasn't the first of many. If someone were about to embark on a Data Mining advanced degree, I don't think this book is the best route to go. I would suggest Handbook of Statistical Analysis and Data Mining Applications as an introduction for that audience. I also think it is an outstanding choice for a seminar leader that wants to offer demonstrations for the audience. I would suggest providing the audience with copies (or allowing them to get them). What a great way to learn the material - by doing. I debated using this book for exactly that purpose and ended up going with the Handbook of Statistical Analysis and Data Mining Applications only because I felt my audience, representing larger companies, would end up using one the Data Mining suites in the end, and I wanted them to see them.I would also suggest this book for self study. It is as easy a read as this kind of material is going to get. Technical? Yes. Light reading? Not really. However, Data Mining algorithms never make for light reading. What you hope for is clarity, and the right amount of detail. For the uninitiated, this is perfect. For Data Mining professionals, it would be just a very basic review. Some reviewers seems to have found it a tough slog. It is very much in the style of \"here is the rough idea - try a case study\". If you've never studied statistics, there is no careful walk through of the formulas, but that is not the point of the book. Lots of other books do that. If you want to know how Data Mining works \"under the hood\" you won't really find that here either. For example, Regression is covered in about 15 pages. Overall, I think it makes good choices in terms of detail.It covers all the material you need in an introduction. It offers a very brief initial chapter defining the subject. It does a decent job at data visualization. It is a basic introduction the algorithms with supporting case studies. The is almost no data preparation because XLMiner is not designed to do any heavy lifting here. It can do partitioning and explains why this is critical to data mining. For a good discussion of data preparation and Excel read Linoff's fine book Data Analysis Using SQL and Excel. A surprising number of the famous techniques are here: neural nets, k nearest neighbors, clustering, classification trees and even time series analysis. The case studies are fairly basic, but well described. They are easy to download from the website. Again, perfect for a first course in Data Mining. Everything an instructor would need for a good solid introduction - exactly the audience the book was written for.", 
  "title": "Data Mining for Business Intelligence: Concepts, Techniques, and Applications in Microsoft Office Excel with XLMiner"
}