{
  "asin": "1107422221", 
  "price": 120.65, 
  "reviewText": "In my Advanced Statistics class one of the text books wasThe Elements of Statistical Learning: Data Mining, Inference, and Prediction, Second Edition. I found some of the chapters in this book heavy going and I had to read them several times and ask the professor lots of questions before I understood the material.In contrast, Machine Learning by Peter Flach is a very well written, very gentle introduction to machine learning algorithms. Prof. Flach writes that he spent four years writing this book and it shows in the care with which the material is presented.The mathematics used is algebra, exponents, summations, products and a bit of linear algebra.  There are only a few places where derivatives are used (as it turns out, basic linear algebra can be used to describe many machine learning algorithms). The level of the Machine Learning makes it appropriate for an undergraduate Machine Learning course.Machine Learning covers most of the core algorithms in machine learning. Of necessity what is provided is an overview of topics like linear regression and linear classifiers like Support Vector Machines. These are topics that are covered in depth in book likeApplied Regression AnalysisandAn Introduction to Support Vector Machines and Other Kernel-based Learning Methods.Reading this book without taking a class in machine learning can be difficult because there are no exercises with solutions or projects with data. Machine learning is a practical art. It is very difficult to read a ~360 page book and absorb all of the material without the reinforcement of applying the machine learning techniques. As I read the book I constantly wished that the author had included exercises with the associated data on his web site for the major approaches.  This would also make the book easier to use for a machine learning course, since the professor would not have to develop all of the homework exercises.", 
  "title": "Machine Learning: The Art and Science of Algorithms that Make Sense of Data"
}