{
  "asin": "1107422221", 
  "price": 120.65, 
  "reviewText": "I'm probably to be considered a \"very advanced amateur\" or \"informal professional\" in machine learning techniques. I never studied them in school, but I presently make a living in part by coding up new ones and coming up with ML solutions for commercial problems. Confronting the field for the first time, I wondered how people learned the stuff. Most of the introductory texts just covered neural nets ... and very very badly. Neural nets are still useful, and probably the most mature of machine learning techniques, but throwing them at a beginner without context is a recipe for confusion and dismay.This text, by contrast, barely mentions them, and puts them in their proper context for the beginner. The right way to think about machine learning is starting with *very* basic statistical techniques and probability theory, and building up from there into simple classification and scoring systems, and then on to the rest of the field. The author of this text does it the right way.One of the difficulties of didactic texts in the subject is ... machine learning is a very diverse field. All kinds of gizmos are helpful, and there isn't an obvious taxonomy, as there is in, say, linear time series models. The author takes a very high level view; breaking the field down into geometric, probabilistic and \"logical\" models. I believe this to be original, and a very powerful way of looking at things for the beginner.The progression is well thought out, and each chapter comes with a useful summary and references (one of which has already proved helpful to me) for further reading. The summaries are not mere recitations; they contain useful facts about the strengths and weaknesses of different varieties of models covered, as well as deep insights that are buried beneath useless verbiage and equations in other texts. There are things covered here which are covered in precious few advanced texts: for example, inductive concept learning seemed to fall off the map after the \"AI winter,\" at least as far as most texts were concerned. The book also manages to take the reader to fairly complex topics: boosting, bagging, lasso, meta-learning and random forests. The last chapter has useful guidance on out of scope topics (reinforcement learning, sequence prediction, etc).The text is well written and has attractive and helpful graphs and figures. Better yet, the layout, color scheme and typesetting is the best I have ever seen in a book of this kind. This seems like a small thing, but far too many color texts end up looking like old school wired magazines: they hurt the eyes with useless graphics and insane colors. Just because you have a broad palette doesn't mean you should use all those colors. The typesetter gets this one just right. I commend the author on his eye for beauty here.Downsides: as a unifying didactic text for beginners (or review for non-beginners), it is near perfect, but it does lack problem sets. For me, this is a feature, rather than a bug, but people teaching from this book might find it tedious to come up with problems which go with the text. Perhaps sticking some online would be appropriate at some point.", 
  "title": "Machine Learning: The Art and Science of Algorithms that Make Sense of Data"
}