{
  "asin": "111844714X", 
  "price": 113.76, 
  "reviewText": "When I saw the title \"Business Analytics\" I thought that this might be a book that targeted MBA students who are uncomfortable with graduate level applied math and statistics. Books that follow this pattern provide a cook book approach to packages that do linear regression or clustering, without providing much background. The virtue of these books is that they tend to be more readable than book likeThe Elements of Statistical Learningby Hastie et al.  Elements of Statistical Learning is a classic but it covers complex topics in a few paragraphs or a page. There are parts of this book that I have read again and again before fully understanding the material.Data Mining with Business Analytics is a much gentler introduction to many of the topics in \"Elements\" (statistical analysis, linear models and clustering, among other topics). Johannes Ledolter writes clearly and walks the fine line of discussing the mathematical background without providing a deep discussion of the mathematics.As the title suggests, the examples are in the R statistical language. I have been using R for several years and have become an R fanboy. I see R as an indispensable platform for doing data analysis.  The R examples are generally well developed. R includes a number of data sets and many authors use these data sets to illustrate analytic techniques. I am starting to feel that the prostate cancer data set, which is used in this book, is getting a bit old and I propose a moratorium on its use.When I studied linear modeling we covered a lot of the mathematical formalism and proofs that this book leaves out. While this did give me a deeper understanding of linear modeling, the cost was some topics, like logistic regression were omitted. This book has a  good chapter on logistic regression.Logistic regression is probably the most popular way to analytically do credit analysis. The logistic regression chapter includes examples of logistic regression applied to lending and credit.The book does not \"talk down\" to the reader. A basic background in statistics is assumed. One of my professors said once that \"MBA students don't like linear algebra\" and I found it interesting that topics like linear regression were presented without linear algebra (e.g., as finite math using summations).The book provides a solid introduction on the techniques and their implementation in R. For anyone using these techniques this will serve as a starting point. For example, the discussion of K-nearest neighbors clustering gives the reader a feel for clustering. For many applications, clustering is more complicated and there are books on this topic.The prices of math and programming books can be hard to swallow. I think that most readers who want an a solid overview of data mining will find that this books does pay back its substantial cost.", 
  "title": "Data Mining and Business Analytics with R"
}