{
  "asin": "111844714X", 
  "price": 113.76, 
  "reviewText": "This graduate-level textbook gives students very good exposure to the use of open-source statistical software R in data analysis, data exploration, and data model construction.  Readers must already know some R basics (e.g., how to install R packages, read help files for packages and functions, and work with basic R data structures such as data frames, etc.) and statistical concepts such as hypothesis testing, significance levels, etc.The book chapters are organized mostly around statistical techniques such as linear regression, clustering, text analysis and social network analysis.  Each chapter usually begins with a discussion of concepts important to understanding the statistical technique in question, followed by descriptions of the datasets and R packages to be used in the hands-on problem-solving exercises.  By following along, readers will acquire useful knowledge on what data modeling problem(s) a particular statistical technique can be applied to, what pitfalls (e.g., overfitting) to avoid, how to utilize the covered R packages and use the provided code examples as templates for studying similar problems.The book has an &#34;applied&#34; emphasis -- discussions of the mathematical details underpinning a statistical technique are kept to a minimum and to a relatively high, conceptual, and practical level.  The datasets are quite varied, covering a wide range of domains relevant to the fields of engineering, business and marketing, economics, and health care.All datasets and code examples are available for download from websites mentioned in the book.  The code examples have comments, but there is room for improvement (for example, readers who are relative R novices may not know why a call to set.seed(x) is required before calling some specific R functions).  A similar observation can be made regarding the graphics presented in the book: providing figure captions and, in some cases, better x- and y-axis labeling (for example, instead of just labeling the x-axis with a 0 and a 1, use labels that indicate what the 0 and the 1 represent or mean), in my opinion, could help enhance the reading experience.Overall, however, I thought the book is written at a level that its intended audience will find accessible.", 
  "title": "Data Mining and Business Analytics with R"
}