{
  "asin": "111866146X", 
  "price": 26.77, 
  "reviewText": "Having been involved in both electrical power monitoring (very data intensive) and business intelligence software (provides business reports from database sources) for well over a decade now, I agree with the author's premise that there's a difference between data and information. I wrote an article on this subject for the Crystal Reports market, and it's featured on the Crystalkeen Website. Too much of what pretends to be &#34;analysis&#34; or &#34;information&#34; or &#34;business reports&#34; is simply reformatted data and not very useful.Another premise of this author is that the data analysis function serves the business, not the other way around. This point is often lost upon those who are supposed to provide the analysis. Rather than answer business questions, they just provide analysis. Their thinking, such that it is, revolves around the idea that they best do their jobs when they can do the neatest tricks with the analysis system.These are just two examples of several &#34;wrong thinking&#34; ideas that Foreman addresses in this book. Because these &#34;wrong thinking&#34; ideas are pervasive and cause the misallocation of millions of dollars of resources in the typical large company, this book is worth several thousand times its cover price for the typical large company. Scale down the cost as you scale down the enterprise, and the multiplier is obviously less dramatic but still quite potent. Assuming, of course, the reader grasps what Foreman is saying and acts upon those new insights.This assumption has some teeth to it, because Foreman is a very clever writer. In addition to using humor to keep the reader engaged, he apparently labored long and hard over his word choices to get clear meaning across to the reader. This is something I greatly appreciate in a work of nonfiction. Typically, the subject matter expert lacks such a command of English and something gets a bit muffed in the translation from text to the mind of the reader.Now, that's my commentary on the high-level stuff. Which does not comprise the bulk of this book. I addressed it first because, to me, this alone makes this book a &#34;must read&#34; for anyone involved in data analysis, business intelligence, or related fields. Too many in these fields cannot see the forest for the trees, and their penchant for getting mired down in insignificant details shows in the results of their work. They wonder why users waste many hours trying to do their own analysis in Excel, instead of looking at whether they are providing a useful service to the business and its decision-making needs.Let's move on to the technical stuff covered in this book. At one time in my career, I was a spreadsheet junkie. I built very complex models in Excel. So I was delighted to walk through Foreman's examples and tutorials on using Excel to do various kinds of analysis. These examples and tutorials comprise the bulk of this book, but they are not the point of the book.Let me explain by analogy. I'm not sure if this reaches the typical reader, but try to follow (and accept my apologies if it's a dud). In electrical engineering today, software does the number crunching for you. But in engineering school (and often in the friendly debates engineers have), the modus is on manually doing the calculations. When you read the electrical engineering trade publications, you find not an admonition to run the example through your software but you find manual calculations being walked through.The reason, in all instances, is the participants must be able to understand the concepts. You can do this only by crunching the numbers yourself and following along in the mental processes of arriving at the answer. So the author of an article might provide quite a trail of calculation to prove a point. It's the point that matters, not the calculation per se. But you don't get the point unless you can see how it's arrived at.For example, in this book Foreman discusses K-analysis. How can you really understand this without working through some examples and watching the effects on the data? Answer: You can't.To me, being walked through this litany of hard-to-grasp data analysis concepts is the only way a person can really understand those concepts. I think a mere surface knowledge is insufficient (a little knowledge is dangerous....). Even outside the realm of data analysis, people toss about terms they clearly do not understand but think they do. But based on my many years interacting with Crystal Reports administrators and trainers, I think the problem is especially pernicious in this particular  field of data analysis. If you really want to know what you're talking about, you need to do the learning work.The first nine chapters walk the reader through data analysis concepts. Chapter 10 is an introduction to an analysis program called R. Foreman begins by summing up the previous nine chapters as an exercise in learning analytics and then making it clear that Excel isn't the right tool for actually doing analytics.I don't believe Foreman is trying to &#34;sell&#34; R per se. It's what he's familiar with. There are other tools for data analysis, including the big players in the Business Intelligence (BI) market, such as Crystal Reports and Cognos. Basically, if you want an effective, accurate, efficient way to answer business decision-making questions from the data your business gathers, you need to step up to a tool designed for that job. And, of course, you need an adequate database behind it.Foreman has excellent advise in his 11th chapter (which is not numbered), &#34;Conclusion.&#34; It's only six pages long, but what he says in here is profound. If you, as the reader, grasp nothing else but what's in this conclusion, the book has served you well.", 
  "title": "Data Smart: Using Data Science to Transform Information into Insight"
}