{
  "asin": "1420067184", 
  "price": 40.5, 
  "reviewText": "I chose to use this book for a course on machine-learning for computer scientists that I taught in the spring of 2011.The main reason for selecting it involved its use of the python language, and a more overall programming-orientedapproach to machine learning. I do believe the author has the right idea, assuming the targeted audience is cs majors whoneed some basic introductory exposure to the subject. Yes, the author does walk a fine line between trying to provide somedegree of mathematical rigor, and yet not overwhelming the student with too many equations. In doing so, he trips and stumblesseveral times throughout the text, but, in the end, I do believe that the average undergraduate would benefit from this bookmore so than from a more traditional math-oriented ML book. So it does fill a niche in the ML literature. To improve the book,say, for the next edition, I would suggest toning down the \"cs students need to have their hands held when doing math\"attitude that is purveyed throughout the text, and adding a bit more rigor where needed.Also, I found much of the python matrix code very slick and often hard to follow. For this reason, the final chapter oughtto be the first read (for those students with no python background) and more examples and exercises should be giventhat reinforce the matrix manipulations. I also suggest that the next edition include more problems at the end of each chapter,and simple exercises throughout the reading,especially ones that help students practice both the mathematics and the programming. Having lots of exercises can help smoothout some of the discontinuities that are found throughout the text. By \"discontinuities\", I mean at times taking large leaps fromintuitive wordy explanations, followed by jumping into the mathematical models.A great example of a textbook that succeeds in walking the above tight rope is \"Theory of Computation\", by Michael Sipser.Every future author who wants to balance accessibility and rigor ought to first read this book for inspiration. Anothergreat success story is Mitzenmacher's \"Probability and Computing\". So it can be done! And I hope to give the second edition ofthis book 5 stars!", 
  "title": "Machine Learning: An Algorithmic Perspective (Chapman &amp; Hall/Crc Machine Learning &amp; Pattern Recognition)"
}