{
  "asin": "1441998896", 
  "price": 30.4, 
  "reviewText": "I am so happy I decided to buy this book. From the first page it is clear the author writes in excellent, approachable style -- there is no single place where I could find the author shows off his knowledge, nope, Graham Williams really teaches so the reader could understand. He allows to make friends with data mining in painless way; I appreciate the fact the first approach to each technique is done via GUI frontend (Rattle), but then the internals of R are explained -- the name of the package is given, how Rattle calls this or that function behind the scene, and also how to interpret the outcome, so in the end it is not only about the clicking with mouse.I find this book very valuable for two reasons -- the comfort it provides (scientific book, and you want to read more and more), and it helps you focus on modeling the data, tweaking, etc (big plus for emphasis on training, validation and testing the models). However it is introductory book (I just can wish every introductory book was so informative and friendly). It is not related to the topic of data mining, but I noticed with pleasure the clear voice for open implementations of algorithms -- I can only concur that public reviews and collaboration allow to move things forward in faster pace.If you would like to learn by example what the data mining is, how to apply, compare various algorithms this is the book for you. If you already know that and you would like to translate your knowledge to R, to some degree I would also recommend this book. This is not a book for learning R per se, so if you don't know the R it won't teach you that (rather make you a bit familiar), but don't worry, you can stick with GUI.The book is not perfect though. From time to time I missed explanation of the outcomes presented in the book -- the author does not have to spell out for me that I am looking at number \"0.74\", but the tip what does it mean is valuable (i.e. there are such explanations, but not in every desired place, at least by me). Second -- I would love to see more discussion about tough cases and how to handle them. Even such extremes, that surprised the author himself. Mistakes he did, the graphs that led him in the wrong direction, and so on. Such issues here are just lightly touched, not enough for my taste.The biggest complain is not about the content itself, but the way Springer published this book. OK, it is in color, I love it, and I am grateful. But thanks to shiny paper and weird binding, not only I couldn't put this book flat but with every page turn I had to maneuver to kill the glare. In this regard, I can say it was unpleasant experience, because of arm fatigue (book is heavy!) and all the trouble.Don't let those problems detract your from paying attention to this book -- if you are curious about data mining, or interested in it, and you are not an expert already -- solid buy!", 
  "title": "Data Mining with Rattle and R: The Art of Excavating Data for Knowledge Discovery (Use R!)"
}