{
  "asin": "1449303714", 
  "price": 40.27, 
  "reviewText": "If you are looking for a book that demonstrates machine learning concepts using the R language, then this is the book for you.  Drew and John have written an excellent book on presenting machine learning concepts like classification, clustering, recommendation, network graphs, and SVMs to name a few.  The authors do a great job of presenting how to apply these machine learning algorithms and explain the general concepts of the algorithms, which is the focus of the book.  If you are looking for a book that provides an in depth coverage of machine learning algorithms, then this is not the book for you.  In addition, the authors do provide some explanation of the R scripting language that they use throughout the book to apply the machine learning algorithms to different data sets.  They provide some depth of what the code is doing, but by no means is this a book that explains the details of the R language (not the authors intent).  If you have developed software in other languages like Python, then you should find yourself able to follow and execute the examples that they walk you through in the book.  Therefore, if you are looking for a book that will provide an understanding of the R language, then you will want to look at other books that are focused on the R language.  O'Reilly has many book that provide the detailed explanation of the R language and is the focus of those books.  Again it is not the intent of the authors to either provide in depth coverage of machine learning or the R language, but to demonstrate machine learning using the R language which they have done very well.  I really enjoyed working through the examples and learning how easy it is to utilize the extensive library of algorithms that the R language provides.Therefore, if you are new to machine learning and are familiar with reading either R or another scripting language, then you will enjoy this book.  You might find yourself needing to search the internet for more detailed explanation of the machine learning algorithms, but you will still enjoy how simple they are able to be implemented in the R language by using the extensive library of algorithms.  You will enjoy this book even more if you are interested in both the R language and Machine learning, since that is the focus of the book.  In the case where you are more like me, you have the background of many programming languages, machine learning concepts and algorithms and are interested in learning more about machine learning and R, then this is perfect for you.", 
  "title": "Machine Learning for Hackers"
}