{
  "asin": "1449303714", 
  "price": 40.27, 
  "reviewText": "Drew Conway and John Myles White&#8217;s credentials are impeccable&#8212;Conway used to work in intel, White is a psychologist, statistician and maintainer of several &#8216;R&#8217; packages. Their new book, &#8216;Machine learning for hackers* (ML4H)&#8217; uses the successful O&#8217;Reilly mix of code and conversation to take the reader through various sample tasks.ML4H uses the open source &#8216;R&#8217; programming language throughout and assumes knowledge of command-line work. R provides data formatting visual-ization, statistics and analysis in a moderately terse syntax. According to ML4H, R has seen a &#8216;meteoric rise&#8217; in the data sciences and machine learning communities&#8212;making it the &#8216;de facto lingua franca&#8217; for analytics.R provides tools for massaging ugly real world data into shape ready for visualization. Father of data analysis John Tukey is credited with the distinction between exploratory and confirmatory data analysis&#8212;the first used to identify trends, the second to see if they are statistically significant. R does both of these&#8212;a few lines of code turns a ragged public domain &#8216;big data&#8217; set into an almost Share-Point-esque dashboard.Then comes the smarts. Key to real machine learning is Bayesian statistics, combining data driven probabilities with prior knowledge. Examples such as determining a person&#8217;s gender from &#8216;her height and weight&#8217; (a she maybe?) are easy to envisage in more pertinent domains such as deriving lithology from seismic attributes and logs, or in root cause analysis of maintenance data.R&#8217;s capability to work on text analytics is demonstrated in the Bayesian spam detector. A single line of code removes &#8216;stop words,&#8217; further natural language processing performs word counts and more statistics to separate the spam from the ham. Again&#8212;industrial use cases of such techniques abound. Also of interest is the section on multi-dimensional &#8216;spatial&#8217; analytics which uses matrix operations like distance metrics and multi-dimensional scaling to put US senators&#8217; voting patterns on the map.A couple of niggles&#8212;some unnecessary neologisms&#8212;what the heck is a &#8216;gization?&#8217; and some graphs could do with better labeling. The authors warn against using R on really big data&#8212;suggesting that such should be recoded in C. This is not necessarily the only option. A press release from Teradata this month announced an R interpreter for its high-end data appliance. R is also available in Spotfire&#8217;s statistics services layer.Review originally appeared in Oil IT Journal - oilit.com.", 
  "title": "Machine Learning for Hackers"
}