{
  "asin": "1449358659", 
  "price": 26.67, 
  "reviewText": "... helps the medicine go down, as Mary Poppins used to say. An IT-focused publisher, O'Reilly has twice before used the \"book as collection of chapters by different contributors\" formula in its foray into the attractive \"data\" niche, with such titles as \"Beautiful data\" and \"Bad data\". \"Doing data science\" - by the way, I prefer Hastie and Tibshirani's \"statistical learning\" to the fuzzy and grandiose \"data science\" - follows the same approach, but, with its subject matter being closer to the academe, the company enlisted two young PhDs to steer the collaborative effort. Rachel Schutt took the lead as author and editor, and, assisted by Cathy O'Neil, produced an engaging, informal - you don't often see \"science\" in the title and \"huge-ass\" in the text - yet sufficiently technical to be hands-on, sequence-of-vignettes-styled book. Imagine a mash-up of a magazine article and a textbook. Neither part may be best-in-class, but their combination makes for a \"unique selling proposition\".Well, maybe not a textbook. Most textbooks are carefully written and carefully checked. In contrast, when I see \"Doing data science\" introduce  the ROC curve in three places, one of which translates the \"O\" as \"operator\", I can guess that this is a copy-paste of papers by three contributors. When Dr. O'Neil casually redefines an English word (\"causal\") to avoid rewriting a couple of sentences, or pronounces, on page 159, that \"priors reduce degrees of freedom\" - this is painfully meaningless, and neither term is defined, only name-checked - I suspect that she knows better, but just did not feel like spending more time on her half-chapter. Neither author speaks of their own projects - if this is the \"frontline\", then it's other soldiers' \"trenches\" that we are visiting. The occasional code listings are borrowed as well, thrown in without editing or comments. In this last regard, \"Doing data science\" lags far behind the book that seems to have informed its choice of topics, Peter Harrington's \"Machine learning in action\". (That's one suggestion - and if you want a good, accessible textbook, \"Introduction to statistical learning\" by James et al. is another).None of it is going to matter to the book's target audience. \"Doing data science\" is aimed at beginners - and is bound to be interesting and useful to thousands of keen undergrads and adult learners.", 
  "title": "Doing Data Science: Straight Talk from the Frontline"
}