{
  "asin": "1449358659", 
  "price": 26.67, 
  "reviewText": "This is a beautiful, thoughtful survey with excellent references.  I am an academic data scientist with nearly 20 years experience and I wanted a book to offer my students who are starting in the field.  This is it.The \"difficulty\" with data science is in the breadth of skills that are needed. Because data scientists need training in art, communication, statistics, and programming nobody is prepared to handle all the tasks and the neophyte (and expert) will need to fill in around their weaknesses.  This book does a brilliant job of working around that issue.  The writing is superb for a beginning to intermediate reader and the graphics and aside boxes are engaging.  More importantly. the references are plentiful and spot on.  In the areas I know well the authors suggest the things I recommend and where I am weak the recommendations have proven interesting.While this is a broad survey, there is some depth here.  There are formulas throughout but the book does not get bogged down in proofs and derivations.  There are programs written in R code scattered throughout.  The code is nicely commented but there is not a deep dive into how it words.  So, the reader who knows some R will learn a few new tricks but it does not interrupt the flow of the book.A reader who types the R code will run into problems.  Clearly the authors/editors did not attempt to run the code after the type setter mangled it.  For example, on page 39 there is a line which begins with a + and that character needed to be on the previous line.  In other places, (like page 49) functions are invoked (count) but the authors have not included the commands to make the functions available (in this case library(plyr)).  Sadly there does not seem to be an errata for the book and these will be major headaches or show stoppers for novices.While this book could be improved with a code supplement on the web (including the code to make all the graphics, complete solutions to the example/problems and an errata), this is a wonderful buy for readers of all levels.", 
  "title": "Doing Data Science: Straight Talk from the Frontline"
}