{
  "asin": "1449358659", 
  "price": 26.67, 
  "reviewText": "\"Doing Data Science: Straight Talk from the Frontline\" by Cathy O&#8217;Neil and Rachel Schutt; O'Reilly MediaWith so many books being published on Data, from Big Data to Machine Learning to Data Analysis, we must ask what yet another book is going to offer us.  And the answer is not that much.  O&#8217;Neil and Schutt have seemingly written this to give us a view of how the ins and outs of the actual world of Data Science are practiced.  But we get little more than an overview of what Data Analysis is in general.Many topics a reader might find interesting, whether for background knowledge or otherwise, are given little emphasis, and even then, without much depth.  As an example, a discussion on the Exponential Distribution merely states that &#8220;because we are familiar with the fact that &#8216;waiting time&#8217; is a common enough real-world phenomenon that a distribution called the exponential distribution has been invented to describe it.&#8221;  Any mathematician realizes that inventing probability distributions are a little more involved than is implied.The main part of the book starts with a look at algorithms.  The authors use R as their primary language.  There is little in terms of explanation of the underlying processes and examples are pretty direct.  Nave Bayes, for example, is explained in a page and a half, so we can clearly say that this is an overview of many of the ideas going into Data Science.  In fact it is a very wide overview.  Financial Modelling, Spam Filtering, Epidemiology, the list goes on.  This is definitely a plus; we see the wide applications that Data Science has.The book ends with a discussion on Competitions, but we come back to the question of what we have gained more than we might get by a simple perusal of the web?  Maybe I was hoping for more out of the book than I got; expectations can be a killer.  But in the end we must make a choice.  If we would like to know about Data Science &#8211; how it&#8217;s done &#8211; then we would probably like to look elsewhere.  If we would like to have some book that we can show someone what areas exist within this field and what topics are touched upon in it (perhaps for an advisor), then this book should do fine.(FTC disclosure (16 CFR Part 255): The reviewer has accepted a reviewer's copy of this book which is his to keep. He intends to provide an honest, independent, and fair evaluation of the book in all circumstances.)[...]", 
  "title": "Doing Data Science: Straight Talk from the Frontline"
}