{
  "asin": "1449358659", 
  "price": 26.67, 
  "reviewText": "Doing Data Science is actually a bit of an oddity; an easy read in a deeply technical field. The book is based on a series of lectures and aims to inform the reader how data science works rather than simply providing a cookbook of recipes to carry out processes. For me this approach worked very well; after trawling through endless examples and documents of the data science flavour of the year map reduce I can finally say that I understand the process. Of course if you are labouring under a pointy haired boss who has heard the term data science in a meeting and is pressing you to use all its latest and greatest techniques this approach may seem a bit frivolous, but it&#8217;s well worth the investment. Understanding the process will speed up your implementations and will also inform you as to what approaches are valid with what you want to do. I&#8217;ve played with the big data hero du jour map-reduce a few times and never really knew what I was doing; having read Doing Data Science I have a reasonable clue as to what is supposed to happen so I can at least sanity check my next attempt rather than just try and hack example scripts and read impenetrable howtos.Not only is Doing Data Science informative it&#8217;s also a light and engaging read which is no mean feat in a domain that tends towards the dry and dusty. The authors have certainly done an excellent job of bringing together a thorough grounding in the data science domain and pull together a lot of data from different areas into a book that is coherent and eminently readable. If I do have any grouch it&#8217;s the title; I would have been inclined to call it Understanding Data Science rather than Doing Data Science which I think covers the content a little more accurately. Overall though I would thoroughly recommend Doing Data Science to anyone interested in understanding the field rather than simply implementing it.", 
  "title": "Doing Data Science: Straight Talk from the Frontline"
}