{
  "asin": "1449361323", 
  "price": 31.89, 
  "reviewText": "At it's core, Data science is the elimination of guess, intuition,hunch and  decisions backed by Data .Data Science is ranked the Sexiest Job Of 21st Century by Harvard Business Review. Today there is a tremendous demand for everything \"Data Science\", Companies need \"Data scientists\", IT resources are refocusing themselves to be the \"Data scientists\".  Contrary to popular beliefs that Marketing benefits a lot from data science, companies are finding benefits across the spectrum of their operations . Example : A leading Trucking company used Data mining skill to predict which part of the truck is going to break next instead of replacing it at specific intervals, a Leading insurer predicted those who will complete their antibiotic course based on their home ownership history.  If this type of stories and scope interests you, read the book \"Big Data: A Revolution That Will Transform How We Live, Work, and Think\".I am an aspiring \"Data Scientist\" and so this review will have a slight tilt from a \"Data Scientist\" perspective over the business user.WHAT THIS BOOK IS ?This book is very well written ,but not for the faint heart. It is a text book and authors have taken lot of care so general audience can also benefit from it, and also not to dilute it's textbook value. To get the full benefit of the book, read about 50 pages  ( Do not flip pages), never more than 10 -15 pages per session. The book is intense so you will need to take a break in between or will lose the thread. Once you are finished with fifteen pages, go to the first page and read , highlight the important areas and  then go to the next page. So plan to read this book in a span of 2 -3 months. I know it is slow but if you want to understand the inner workings of \"Data science\", there is not much other option. Alternative is to flip across several superficial articles that is a staple diet of every blog and magazines.WHAT THIS BOOK WILL DELIVER ?When you are finished with the book, you should have a fairly good understanding of data science, For example, what type of analysis that needs to be done to identifyA. Will the Customer switch loyalty ? ( Yes / No )B. What type of customers will cancel my subscription ? ( Ex : Middle Aged male from Manhattan will be 5% more likely to switch)C. What are the methodologies to identify If I can up-sell a customer ( Ex : Someone who bought this book also bought )D. What is a supervised Segmentation and When will you use it ? ( When the target is clear, if the person will default on his loan)E.  What is the significance of entropy in Data Science ?F. Exposure to several formula's ( sleep triggers as I call it). Many of the tools have in-built formula's but you still need some idea what these formula's are.G. Don't get defensive, be comfortable when your colleague sprinkles words like like Classification ,regression, Similarity Matching, Clustering, Modelling, Entropy etc.WHAT ELSE YOU WILL NEED ?Data Science does not exist in silo. It helps in decision making .  So should be your learning, Here are my suggestions:1. First and foremost, you need to spend consistent time. If you are running short of time, don't even bother to start2. For those who are interested in understanding Data science, courseera dot org conducts a free 8 weeks course on \"Introduction To Data Science\" by an eminent Stanford Professor. It needs time and Commitment3. You can get real life examples to work on in coursesolve dot org ( ex: Analyze the sleep cycle)4. As a Data Scientist, you will need to understand \"Big Data\" . Browse an article and even experts use Data Science and Big Data interchangeably. Hadoop is the core of Big Data,but it is a world of it's own.5. Read and start experimenting with Hadoop , PIG , HIVE, HBASE and the variations it offers. I did a basics training at edureka dot in , an Indian firm, not a great training but enough for you to understand and then go on your own. But if time and money permits, go to cloudera website and sign up for training. you will not go wrong6. I signed up for Amazon elastic map reduce which has a higher level abstraction (for developers it is the difference between using sqlplus vs TOAD). It is not free but very cheap.7. Try to be the \"umbilical cord that looks for a stomach to plug \", look for a mentor, look for opportunity in your firm or elsewhere to grow your Data scientist skills.For those looking for inspiration , google for Rayid Ghani, Chief Data Scientist at Obama 2012 Campaign.", 
  "title": "Data Science for Business: What you need to know about data mining and data-analytic thinking"
}