{
  "asin": "1449361323", 
  "price": 31.89, 
  "reviewText": "Companies to compete today are seeking new ways to dramatically improve operational efficiency, increase revenues, rapidly develop and bring innovative products to market. As a result, data science principles and data mining techniques are being expanded and applied at an ever increasing rate to support these strategies. Almost every industry is investing in the exploitation of data to find any competitive advantage it can.To help those less conversant on these new tools, authors Foster Provost and Tom Fawcett have produced \"Data Science for Business.\" This will be a particularly useful book for business people who will be working in the field, business people (like me) who just want a basic understanding of how it can be and should be used, developers who will be implementing solutions, candidates for data science jobs, and, of course, their hiring managers. The book is a product of Provost and Fawcett's applying data science to real business problems for more than two decades. It was introduced by Provost as a textbook for New York University's Stern School in 2005.This is not a book about algorithms or an instructional manual on how to find data solutions for particular problems but rather an introduction to a small set of fundamental concepts that underlie techniques for extracting useful knowledge from data. These provide the foundation and building blocks for all algorithms.While the authors claim that the reader does not need a \"sophisticated mathematical background,\" the reader will need more than basic math to grasp the underlying concepts. Remember that this text is used as a college text book so do not expect a quick and easy read...the material is very technical as the authors intend to impart a significant understanding of data science.The primary goals of this book are to help the reader view business problems from a data perspective and to understand principles of extracting useful knowledge from data.  A data perspective provides structure and principles; an objective framework to systemically analyze business problems. In today's world, it has become increasingly important to, at the very least, understand the basics of data science, even if you never intend to use it yourself. Data analytic thinking is the key to business in the 21st Century.", 
  "title": "Data Science for Business: What you need to know about data mining and data-analytic thinking"
}