{
  "asin": "1449367615", 
  "price": 31.2, 
  "reviewText": "In the Fall of 2013, I attended THAT (The Humanities and Technology) Camp &#8211; Pittsburgh.  One of the sessions that was most interesting was in part, a discussion of using data mining to examine a series of letters to show relationships between authors over a period of time to help, among other things, begin to sketch out relationships and influences on writing style.  I was immediately struck at the value of applying this to one of my own areas of study &#8211; the epistolary gregarious (and often quarrelsome) Beat Generation writers.  However, my experience with the technique was almost nil.  When Matthew A. Russell&#8217;s Mining the Social Web became available, I picked up a copy in hopes that it would provide me a door into the practice, and was not disappointed.As a relative newcomer to the world of Data Mining, Matthew A. Russell&#8217;s Mining the Social Web is a welcome guide.  Russell&#8217;s discussion includes a step by step approach, complete with code examples and samples from GitHub that make this a useful primer even for those, like me, with limited programming experience (especially useful, though not necessary, for interacting with the book is a basic understanding or some experience with the Python language).The book has a very broad scope (as is appropriate for a primer) and will require a level of dedication from those new to the field.  The book&#8217;s examples and discussions are grounded in the Twitter API (and features over 24 examples of &#8220;recipes&#8221; to be used for mining data from the service) and so allows the opportunity to answer questions like:&#8226; Who knows whom, and which people are common to their social networks?&#8226; How frequently are particular people communicating with one another?&#8226; Which social network connections generate the most value for a particular niche?&#8226; How does geography affect your social connections in an online world?&#8226; Who are the most influential/popular people in a social network?&#8226; What are people chatting about (and is it valuable)?&#8226; What are people interested in based upon the human language that they use in adigital world?Mining the Social Web is not a book that&#8217;s designed for a higher level audience, and, I think that&#8217;s a good thing.  Russell knows his audience and hits the sweet spot for those of us looking to either get started or become involved more deeply in the field.So while there may not be directly applicable examples here for my project (Russell doesn&#8217;t do the work for me), the knowledge gained from the text and its use a reference tool and as a spark for ideas makes this a valuable resource for me and others in my particular cohort within the digital humanities (A final, parenthetical piece of advice: Mining the Social Web works much better as an e-book purchase because of the many, many hyperlinks embedded.  I recommend the e-book over the print version for this reason)", 
  "title": "Mining the Social Web: Data Mining Facebook, Twitter, LinkedIn, Google+, GitHub, and More"
}