{
  "asin": "0123747651", 
  "price": 26.75, 
  "reviewText": "This book is for practitioners, not for those seeking a deeper understanding of data mining.  It both makes and delivers on that claim.  All major data mining topics are covered, though in a necessarily shallow manner in keeping with the book's goal of getting past the theory and moving to the practice.Oddly, the very start of the book does have a bit of theory in the form of the historical roots of statistics and the limitations of statistics that leads to the need for data mining; I found this bit of history quite fascinating and enlightening; it is something I've found in few other data mining books, and I've read several.The trouble is, I do like theory a bit.  I have a master's in computer science, so I'm a bit biased that way, thus my relatively low scoring of the work.About 1/3rd of the book is dedicated to working through real problems, and that is the overwhelming strength of the book.  If you are one who learns by doing rather than by theorizing, you'll find this book outstanding.The biggest criticism I have of the book is that it is clear that there are significant parts where the authors just didn't have their hearts in it; it felt like they wrote certain sections because the publisher told them they had to in order to hit some type of target marketing segment.It's also unfortunate that all three software products provided expire in 90 days or less.  I'm never one to accomplish anything in 90 days, let alone get through a 700-page technical work!!!  I know they are the 3 top mining tools, but I much prefer RapidMiner, a product that is amazingly feature-rich, so easy to use it is actually fun, supported by a robust open-source model, and free.Overall, a solid work.  But to me, theory matters, that's one star down; and rigorous, enthusiastic writing matters, so that's two stars down.  In the 3-stars that remain is lots of hands-on practice if you don't mind expiring software, and for that it is very strong.", 
  "title": "Handbook of Statistical Analysis and Data Mining Applications"
}