{
  "asin": "0123747651", 
  "price": 26.75, 
  "reviewText": "The \"Handbook of Statistical Analysis & Data Mining Applications\" is the finest book I have seen on the subject.  It is not only a beautifully crafted book, with numerous color graphs, chart, tables, and screen shots, but the statistical discussion is both clear and comprehensive.The text does not use only one statistical data mining application to display examples, but provides a rather thorough training in the use of both SAS-Enterprise Miner  and STATISTICA Data Miner.  A section on SPSS Clementine is also provided, giving comparisons between the various packages. Also employed are STATISTICA's C&RT;, CHAID,  MARSpline, and other data mining and graphical analytic tools.The text does not burden the typical data mining researcher with the internals of how the various tools work. It is therefore not steeped in equations. Some are to be found, of course, but the emphasis is on understanding the concepts involved and on how to apply these concepts to real data - which is provided to the reader in terms of data tutorials. Specialized datasets have been prepared by both authors and outside experts in various areas of inquiry ranging from entertainment, financial, engineering, clinical psychology, dentistry, demographics, medical informatics, meteorology, astronomy, and more.  Each tutorial is associated with data stored on either the associated CD that comes with the book, or which can be downloaded from a companion web site.  Worked out examples of how to use data mining techniques on such data is provided to help the reader gain a solid feel for the data mining enterprise.  The final third of the book is devoted to a partial selection of the available tutorials. The two earlier chapters demonstrate how to use data mining software for the analysis of data.I highly recommend this work to anyone having an interest in data mining. I might also add that the Amazon price of $72.37 is truly excellent for an 864 page academic text, having full color tables and screen shots on some one-third of the pages, plus a CD. A bargain indeed.", 
  "title": "Handbook of Statistical Analysis and Data Mining Applications"
}