{
  "asin": "0070428077", 
  "price": 50.27, 
  "reviewText": "Intelligent machines can be characterized, at least qualitatively, by the degree to which they require interaction with another intelligent machine in order to learn or engage in problem solving, the degree to which they can construct theories explaining data in a given domain, the degree to which they can think in more than one domain, the degree of curiosity that they possess, and the degree to which they take on these tasks by themselves and not under the instigation of an external entity. There are many (non-human) machines today that have some of these characteristics, thanks in part to the research contained in this book, among many others.The book is a collection of work in artificial intelligence that was undertaken almost 25 years ago, but some of it is still relevant today. At that time researchers were still unsure as to what constitutes machine intelligence, and to a large degree the lack of a general definition has continued to this day. But one can argue with confidence that machine intelligence has finally taken a foothold in the real world, and in fact is now undergoing an explosion in application, particularly in areas such as network management, finance, medicine, and bioinformatics.The characterization of machine intelligence given in the paragraph above differs to a large degree to the classification of machine learning systems that is given in this book, but there are similarities. Since the time of publication of this book, emphasis now is placed on the ability of machines to solve problems in more than one domain. In particular, many insist that a truly intelligent machine must be able to use essentially the same reasoning patterns over multiple domains, or as a bare minimum that a reasoning pattern be able solve a problem in one domain and without alteration solve a different problem in a different domain.The editors of this book classify machine learning systems on the basis of the learning strategies that they use, the way that they represent the knowledge or skills that they acquire, and in terms of the domain in which the knowledge is acquired. It is interesting to note however that they distinguish the learning strategies by the amount of inference that the machine is able to perform. A machine that is programmed directly will not perform any inference, even though its knowledge increases. One could call these ordinary machines, and they represent most of the machines at the present time. However, there are at the present time machines that can discover new theories and invent new concepts. These machines the editors argue perform a substantial amount of inference, and therefore are less dependent on the need for tutoring or guidance by a teacher or the external environment. There are machines today that are certainly able to engage in this type of inference. Their reasoning patterns on based on inductive logic and they have been used in automated drug discovery. This book contains other examples of this type of learning, such as learning from examples and from instruction. The ability of some machines today to do this type of learning is a definite sign of the remarkable advances in machine intelligence since this volume was written.", 
  "title": "Machine Learning"
}