{
  "asin": "0123748569", 
  "price": 20.99, 
  "reviewText": "There exists a couple of classics of Machine learning, with various strengths and weaknesses. \"The elements of statistical learning\" by Hastie and company. Bishop's book, \"Pattern Recognition and Machine Learning.\" And now, this book, \"Data Mining.\" I'd say this is the most practical of the three books. The other two I mentioned are oriented towards theoretical underpinnings, and cataloging the rich zoology of machine learning techniques. This one tells you how to get stuff done. Lots of practical ideas on discretization, denoising, data preparation and  performance characterization. It even has practical advice on things you really need an expert opinion on: for example, when using data folding techniques for cross validation ... what is a good number of folds to use? This book will tell you. It's like having a couple of seasoned experts looking over your shoulder when you're trying to get things done. It had a detailed recipe in it for something I really needed to solve... and their recipe worked!While the subject matter is similar to the Bishop and Hastie books: what this most reminded me of was the classic physics text, \"Numerical recipes.\" It's all very well having a good theoretical understanding of the techniques you're using. It's vastly more important to have advice on using them properly. This is that book; uniquely so, thus far, in my experience.It's also a brilliant manual for their Weka machine learning environment, which is incredibly useful. I don't use the Weka UI, but I have called upon Weka as a library extension to the R programming environment. Mostly because of this book: it's both a recipe book and a map to a large collection of recipes you can use to solve your machine learning problems.There isn't so much on time series applications, sadly, which is something I end up working with a lot. I'd love to see an extended chapter on the particular difficulties in using machine learning techniques to mine and forecast time series.", 
  "title": "Data Mining: Practical Machine Learning Tools and Techniques, Third Edition (The Morgan Kaufmann Series in Data Management Systems)"
}