{
  "asin": "0262193981", 
  "price": 58.49, 
  "reviewText": "I have this book more than a year now and I am going through it for the second time, so I think I have a pretty good picture about it.The book consists of three parts.  In the first part, \"The Problem\", the authors define the scope of issues reinfocement learning is dealing with and they give some interesting introductory examples.  Then, they move on to the concept of evaluative feedback and, eventually, define the reinforcement learning problem formally.The second part, \"Elementary Solution Methods\" consists of three more-less independent subparts: Dynamic Programming, Monte Carlo Methods and Temporal Difference Learning.  All three fundamental reinforcement learning methods are presented in an interesting way and using good examples.  Personally, I liked the TD-Learning part best and I agree that this method is indeed the central method and an original contribution of reinforecement learning to the field of machine learning.The third part, \"A Unified View\" present more advanced techniques.  The last chapter gives the most important case studies in reinforcement learning including Samuel's Checkers Player and Thesauro's TD-Gammon.The book is very readable and every chapter ends with illustrative exercises (many of them actually are real programming projects!), always useful summary and very valuable bibliographical and historical remarks.  Some subchapters are more advanced and therefore marked with '*'.  I really recommend first two parts to any student ofd computer science or anyone interested in machine learning and fuzzy computing.  The third part is much more advanced but it would be definitely interesting for advanced computer scientists and graduate students.This is still the first edition of the book which means that the material is almost six years old, but it's the third printing, so there is lot of interest and I would suggest (for second edition) that authors include solutions to (at least selected) exercises, something like Knuth did in \"The Art of Computer Programming\".", 
  "title": "Reinforcement Learning: An Introduction (Adaptive Computation and Machine Learning)"
}