{
  "asin": "0070428077", 
  "price": 50.27, 
  "reviewText": "Machine Learning by Tom M. Mitchell is the first text book for students who aspire to learn the subject of machine learning. It presents detailed and easy to understand illustrations of various concepts that are used in the field of machine learning. These include, necessary topics concerning probability and statistics, artificial intelligence, neural networks and evolutionary algorithms.The best thing about the book is its illustration of feed-forward, back-propagation, multi-layer perceptron (MLP). The good thing about it is that the underlying mathematical concepts are explained in a layman friendly manner. One learns techniques for computing partial derivatives and the chain rule for differentiation for the first time in high-school calculus without having any apparent and significant practical benefit. Their utility becomes clear when one reads and understands how the MLP works. More precisely, Mitchell explains how partial derivatives are computed with respect to the weight coefficients at every step of the MLP so as to guide the gradient descent algorithm to plunge into some locally or globally optimal solution. Similarly, Mitchell shows the significance of applying the chain rule to derive weight coefficients at every layer and node of the MLP with respect to the input values at its first layer. The whole explanation is quite fascinating and exciting.Mitchell also introduces and covers the complicated topic of evolutionary algorithms in a very nice way. Initially various concepts surrounding genetic algorithms are introduced in a lucid manner to make the student comfortable with the subject. Mitchell then illustrates genetic programming. Other important and interesting algorithms are also discussed. For instance, coverage of the famous simulated annealing algorithm is quite interesting. The book is an excellent guide for any student who has began to learn machine learning.", 
  "title": "Machine Learning"
}