{
  "asin": "0321246268", 
  "price": 20.56, 
  "reviewText": "I came across \"Building Intelligent .NET Applications: Agents, Data Mining, Rule-Based Systems, and Speech Processing\" couple of days ago during a regular Borders browse and it suddenly became a page turner. Sara has written an excellent step by step guide to utilize existing enhanced computing tools and technologies to incorporate different characteristic features of intelligence in your applications.This book discusses four major traits of intelligent apps with implementation and executable examples; Agents, data mining, rule based systems and speech processing; Author's writing style is technical and easy to follow. Incorporating tips among text, description of every file used in a VS.Net project and installation instructions are very helpful when trying code segments and sample programs. Also, detailed meta-data and database schema are also provided for a clearer understanding of subject matter. I particularly liked the discussion about speech enabled applications ergonomics.\"Building Intelligent .NET Applications: Agents, Data Mining, Rule-Based Systems, and Speech Processing\" explores the latest Microsoft technologies, some fresh out of the MSR oven. Microsoft's efforts of making AI mainstream with its great variety of products and excellent toolset is to be grateful for. Author walks through different technologies and explains how the collaboration of diverse technologies such as client side scripting, XML, SQL Microsoft's new Speech Application - SASDK, Microsoft XML Parser - MSXML, XML for Analysis SDK, ADO for Multidimensional Objects - ADOMD, Background Intelligent Transfer Service comes in handy as building blocks of enhanced computing application. This book covers telephony applications, multimodal speech applications, Data-Mining Predictions and their applications, evolving database design, Agent Building and the Future of Enhanced Computing. Last chapter is an overview of upcoming technologies like WinFS and intelligent application development roadmap.This book with all of its good features falls short in describing the theory and underlying algorithms for these intelligent components. I guess due to the target audience (developers), author stayed focus on development however there are some introductions to key terminologies in the chapters. I missed this paraphrase most in the rule based systems; it felt like the chapter didn't relate itself much with the broad horizon of rule based systems yet provided a concrete implementation of one.Like author said \"I challenge every developer who reads the book to go out and find some product or technology to make your application better\", I believe its a must-have book for developers / computer scientists who want to integrate cutting edge enhanced computing technologies in their code without spending too much time in R&D; labs; MSR (research.microsoft.com) does it all for them and yes, you can participate.", 
  "title": "Building Intelligent .NET Applications: Agents, Data Mining, Rule-Based Systems, and Speech Processing"
}