{
  "asin": "0321246268", 
  "price": 20.56, 
  "reviewText": "I recently purchased this book on Amazon.  As an experienced .NET software developer, I am always keen on books that will expand my knowledge base in this area, and AI has been a particular interest of mine lately.  Having read through much of the book, I have found it very disappointing.  I would sum it up as a very shallow introduction to AI topics (often referred to as \"Narrow AI\") such as Data Mining.  This book is more a manual on how to use Microsoft technologies, and does not include anywhere near the depth or practical examples needed on the subjects presented.  I have personally found better info online.This book exclusively discussed MS products.  If these are the items the author wishes to discuss that is fine, but I was disappointed in the depth at which the products she included were discussed.  A good example is the MS Speech API.  The author discusses setting up the speech services in an ASP page via Visual Studio, but does not go into any real code.  How do you write custom code for this API?  How do you implement this in a WinForm where speech would seem to make much better sense?  Many sections of the book avoid actual code and focus on screen shots of wizards and configuration tools.The book did do a decent enough job of listing the technologies that MS has made available to .NET programmers.  However, I believe that the author almost sugar-coated the MS stuff.  Where are the downsides of these APIs, servers and tools?  Where are the pitfalls that a programmer should avoid or watch for when implementing agents or data mining or speech services with these MS technologies?  As an MCSD, MCT and as an experienced developer that has used a few generations of Microsoft software development tools, I know that with each of their technologies, there are hidden problems (like any vendor's software).  The author does not impart any real level of knowledge of the practical usage of the technologies at hand.  In fact, the book is left with a feel that a competent Microsoft technical writer could have written the book by simply copying-and-pasting documentation from various MS product lines.I give the book 2 starts instead of one as there are a couple of gems in the book that I think I will use.  However, I wish I had paid about $30 less for the book.", 
  "title": "Building Intelligent .NET Applications: Agents, Data Mining, Rule-Based Systems, and Speech Processing"
}